soapandrest/src/test/resources/update.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://www.baeldung.com/springsoap/gen" xmlns:art="http://www.baeldung.com/springsoap/gen">
    <soapenv:Header/>
    <soapenv:Body>
        <art:updateSoapRequest>
            <gs:soap>
                <gs:id>3</gs:id>
                <gs:name>Test</gs:name>
                <gs:description>Testing</gs:description>
                <gs:price>50</gs:price>
            </gs:soap>
        </art:updateSoapRequest>
    </soapenv:Body>
</soapenv:Envelope>